{
	"intro": {
		"name": "Naphan Choatchuangnapha",
		"nickname": "Little",
		"phone": "0897991699",
		"email": "naphan.ccnp@gmail.com",
		"github": "LittleNa1000",
		"linkedin": "naphan-choatchuangnapha-216995217",
		"location": "Bangkok, Thailand",
		"website": ""
	},
	"projects": [
		{
			"name": "KhunLook Mobile App",
			"details": "Developed API routes using Fastify and designed MySQL database schema for streaks and badges system in KhunLook, an app to help parents monitor children's growth, development, and health from birth to age six. In collaboration with the Ministry of Public Health and other universities.",
			"url": "play.google.com/store/apps/details?id=hda.app.khunlook",
			"hide": false
		},
		{
			"name": "Meet & Feat",
			"details": "Developed user and authentication service for Meet & Feat, a platform for discovering and joining events and clubs in Chula as term project. Demoed and presented to instructors as a term project, resulting in an A grade. Made with NestJS, Drizzle, and Google OAuth. Deployed on GCP.",
			"url": "github.com/SoftwareArch-BackstreetBoys/user-service",
			"hide": false
		},
		{
			"name": "Action Plan Announcer LINE Chatbot",
			"details": "Chatbot for announcing action plan (scheduled tasks) during a long large-scale event. Used by 120+ staff during an actual event, resulting in an increased accuracy of executing tasks on time. Made with Typescript, Node, Express, Next.js, Tailwind, MongoDB, and LINE API. Deployed on Vercel, GCP, and Mongo Atlas.",
			"url": "github.com/esc-chula/vishnu21-ap-frontend",
			"hide": false
		},
		{
			"name": "Nong Little LINE Chatbot",
			"details": "Gemini-Powered Chatbot that replies positive message based on input and sends daily motivational quote to support mental health. Made with FastAPI (Python) and LINE API.",
			"url": "github.com/Cloud-Final-Project-2024/backend",
			"hide": false
		},
		{
			"name": "Byenior",
			"details": "Website for sending and receiving customizable letters between Intania 104 students. Made with Typescript, Bun, Next.js, Tailwind, Supabase, and Prisma. Deployed on Vercel.",
			"url": "byenior.chula.engineering",
			"hide": false
		},
		{
			"name": "Magic Within",
			"details": "Led a team of developers to develop an interactive website for users to overcome self-doubt. Animations, transitions, sounds, and interactive minigames is integrated. Made with Typescript, Bun, Next.js, Tailwind, and Framer Motion. Deployed on Vercel.",
			"url": "magic-within.vercel.app",
			"hide": false
		},
		{
			"name": "Skillbridge",
			"details": "Website for finding part-time jobs for students with a complete user flow starting from applying to receive wages. Made with Typescript, Node, Next.js, Tailwind, NextAuth, PostgreSQL, and AWS S3",
			"url": "skillbridge-soei.vercel.app",
			"hide": false
		},
		{
			"name": "CUatEvent",
			"details": "Event management and discovery platform for clubs in Chulalongkorn using React and Firebase. Developed with a team of 6 people in Thinc. 10 Days Project.",
			"url": "",
			"hide": false
		},
		{
			"name": "RPG Chess",
			"details": "A 2D desktop game where chess pieces have HP and various attacks and abilities implemented using OOP. Demoed and presented to instructors as a final term project, resulting in an A grade. Made with Java and JavaFX.",
			"url": "",
			"hide": false
		}
	],
	"awards": [
		{
			"name": "Top 35 in GHB Open Innovation Hackathon 2025",
			"details": "",
			"url": "",
			"hide": false
		},
		{
			"name": "Top 32 in Thailand Online Competitive Programming Contest",
			"details": "- out of 800+ contestants",
			"url": "",
			"hide": false
		},
		{
			"name": "Asia-Pacific Informatics Olympiad Contestant",
			"details": "",
			"url": "",
			"hide": false
		},
		{
			"name": "1st & 2nd International Olympiad in Informatics Camp Participant",
			"details": "- Ranked 8th out of 25 in the 1st Camp",
			"url": "",
			"hide": false
		},
		{
			"name": "Silver medal in the 16th Thailand Olympiad in Informatics (TOI16)",
			"details": "- Ranked 11th out of 90 contestants",
			"url": "",
			"hide": false
		}
	],
	"technologies": [
		{
			"section": "Languages:",
			"details": "C/C++, Python, Java, HTML, CSS, JavaScript, TypeScript, Node.js, SQL, Go"
		},
		{
			"section": "Frameworks/Libraries:",
			"details": "React, Next.js, Vue.js, NextAuth, Tailwind, MaterialUI, shadcn/ui, Express.js, NestJS, MongoDB, Postgres, Prisma, TypeORM, Drizzle, tRPC, GraphQL, LINE API, Astro"
		},
		{
			"section": "Tools:",
			"details": "AWS, GCP, Linux, Firebase, Vercel, Git, GitHub, Docker, Kubernetes, RabbitMQ, ngrok, Appsmith, Figma, Jira"
		},
		{
			"section": "Other:",
			"details": "OOP, Data Structures & Algorithms, REST API, gRPC"
		}
	],
	"workExperiences": [
		{
			"position": "Solution Engineer (Intern)",
			"company": "LINE Company (Thailand)",
			"url": "https://www.line.me/en",
			"years": ["Jan", "May 2025"],
			"details": [
				"Learned microfrontend and microservice architecture, and software development process as a large enterprise tech company.",
				"Contributed in audience data import and chat feature in MyCustomer using Vue.js and Go.",
				"Fixed potential vulnerabilities in LINE OA Plus using input sanitization."
			]
		},
		{
			"position": "Software Developer (Freelance)",
			"company": "Skooldio Tech",
			"url": "https://www.skooldio.tech",
			"years": ["Oct 2024", "Jul 2025"],
			"details": [
				"Developed Planner Hub, a study planner with personalized daily tasks, to-do lists, and weekly progress tracking, launched in TCASter app.",
				"Developed MyPath+, customizable 3-year study planner with milestone tracker for high school students.",
				"Aims to help students organize their exam preparation consistently and achieve academic goals. Made with React, NestJS, and GraphQL."
			]
		},
		{
			"position": "Intern Researcher",
			"company": "Japan Advanced Institute of Science and Technology (JAIST) in Ishikawa, Japan",
			"url": "https://www.jaist.ac.jp/english",
			"years": ["Jun", "Jul 2024"],
			"details": [
				"Researched Secure Software Development Surveying at Japan with financial support from the institute",
				"Categorized coding practices, OWASP, and CWE guidelines based on implementation steps"
			]
		},
		{
			"position": "Software Developer (Intern)",
			"company": "KKP Dime",
			"url": "https://dime.co.th",
			"years": ["Jun", "Jul 2023"],
			"details": [
				"Worked with the team of developers, QA engineers, and product owners based on Scrum process",
				"Developed new pages for the corporate web with dynamic content and responsive using React and MUI and tested using Cypress.",
				"Contributed to developing and testing Thai Stock Order and Thai Stock Account services using Go and MySQL"
			]
		},
		{
			"position": "1st Place Winner of Student Track",
			"company": "LINE Hackathon",
			"url": "https://medium.com/linedevth/shonma-winner-linehack2023-4081e4c522a0",
			"years": ["Feb 2023"],
			"details": [
				"Developed Shon-ma!, a dating app that allows users to match with others in the same bar using LINE Beacon for location detection.",
				"The app also includes an auto-delete chat history, notifications, and gifting system. Made with Express, Next.js, Firebase, and LINE API",
				"Tested by 50 users on pitching day and later interviewed in LINE Developer Thailand's podcast and a Medium blog."
			]
		}
	],
	"extracurricularActivities": [
		{
			"position": "Senior Web Developer",
			"company": "Engineering Student Committee, Chulalongkorn University",
			"url": "https://tech.intania.org",
			"years": ["Jul 2023", "Jun 2025"],
			"details": [
				"Prepared and converted raw data to CSV for an orientation website with 40,000+ visitors using Python.",
				"Developed and designed SQL database, admin tool, and Node.js server with CRUD, input validation, and file uploading for Intania Run website with 4,200+ registrants using Express, Postgres, Prisma, and Appsmith.",
				"Led a 12-person Operation team in Intania Hackathon. Organized mentoring sessions, mini-hack, final pitching, and opening/closing ceremonies. Developed real-time scoring system to boost engagement on activities.",
				"Led a team of developers and designers to develop a project tracking website to facilitate the internal document process in the organization using Next.js, Tailwind, NestJS, and PostgreSQL."
			]
		},
		{
			"position": "Head of Registration and Website",
			"company": "Larngear Camp 23rd",
			"url": "https://larngear.org",
			"years": ["Jun 2023", "Jan 2024"],
			"details": [
				"Planned and supervised the registration process from 1,335 applicants via the website to 300 final participants.",
				"Recruited and led a team of 20, organized and distributed tasks among the team, created a collaborative environment, and guided team members during the preparation and execution phases.",
				"Developed new features in the registration website using PostgreSQL, Spring, and React."
			]
		},
		{
			"position": "Interactive Website Developer",
			"company": "Warehouse of Heart Exhibition",
			"url": "https://warehouseofheart.coachbychamp.com",
			"years": ["Nov 2023", "Feb 2024"],
			"details": [
				"An interactive website that lets users remind themselves of their goals and memories in the past to create self reflection and discover their beings. Made with NextJS, Framer Motion, and Tailwind.",
				"Gained 11,000+ visitors and 3,000 feedbacks over 3 months with an average rating of 4.4/5."
			]
		}
	],
	"educations": [
		{
			"head": "B.Eng. Computer Engineering",
			"details": "Chulalongkorn University, TH. 2021-2025 (GPA 3.56)"
		},
		{
			"head": "Gifted Science and Mathematics Program",
			"details": "Assumption College, TH. 2015-2021 (GPA 3.87 with diploma)"
		}
	],
	"certificates": [
		{
			"head": "AWS Academy Cloud Architecting (2025)",
			"details": "AWS Academy Graduate"
		},
		{
			"head": "Certified in Cybersecurity (2025)",
			"details": "International Information System Security Certification Consortium (ISC2)"
		}
	],
	"interests": ["Areas : Coding"],
	"resumeUrl": {
		"sourceLink": "https://github.com/LittleNa1000/resume",
		"fullVersionLink": "https://naphan-resume.vercel.app/"
	}
}
