{
	"intro": {
		"name": "Naphan Choatchuangnapha",
		"nickname": "Little",
		"phone": "",
		"email": "naphanccnp@gmail.com",
		"github": "LittleNa1000",
		"linkedin": "naphan-choatchuangnapha-216995217",
		"location": "Bangkok, Thailand",
		"website": ""
	},
	"projects": [
		{
			"name": "Meet & Feat",
			"details": "Developed user and authentication service for Meet & Feat, a platform for discovering and joining events and clubs in Chula. Made with NestJS, Drizzle, and Google OAuth.",
			"url": "github.com/SoftwareArch-BackstreetBoys/user-service",
			"hide": false
		},
		{
			"name": "Warehouse of Heart",
			"details": "Developed an interactive website contributed to Coach by ChAMP exhibition that lets users remind themselves of their goals and memories in the past to create self-reflection and discover their beings with 11,000+ visitors and 3,000 feedbacks. Made with Next.js, Framer Motion, and Tailwind.",
			"url": "warehouseofheart.coachbychamp.com",
			"hide": false
		},
		{
			"name": "Action Plan Announcer LINE Chatbot",
			"details": "Chatbot for announcing action plan (scheduled tasks) during a long large-scale event. Used by 120+ staff during an actual event, resulting in an increased accuracy of executing tasks on time. Made with Typescript, Node, Express, Next.js, Tailwind, Mongo Atlas, GCP, LINE LIFF, and LINE Messaging API.",
			"url": "github.com/esc-chula/vishnu21-ap-frontend",
			"hide": false
		},
		{
			"name": "Byenior",
			"details": "Website for sending and receiving customizable letters between Intania 104 students. Made with Typescript, Bun, Next.js, Tailwind, Supabase, Prisma, and Vercel.",
			"url": "byenior.chula.engineering",
			"hide": false
		},
		{
			"name": "Magic Within",
			"details": "Led a team of developers to develop an interactive website with minigames for users to overcome self-doubt. Made with Typescript, Bun, Next.js, Tailwind, and Framer Motion.",
			"url": "magic-within.vercel.app",
			"hide": false
		},
		{
			"name": "Skillbridge",
			"details": "Website for finding part-time jobs for students with a complete user flow starting from applying to receive wages. Made with Typescript, Node, Next.js, Tailwind, NextAuth, PostgreSQL, and AWS S3",
			"url": "skillbridge-soei.vercel.app",
			"hide": false
		},
		{
			"name": "QAIR",
			"details": "A NodeMCU project that collects CO2, CO, and PM2.5 sensor data and then displays on a website as a dashboard. Demoed and presented to instructors as a final term project, resulting in an A grade. Made with C, Firebase, and Next.js",
			"url": "",
			"hide": false
		},
		{
			"name": "RPG Chess",
			"details": "A 2D desktop game where chess pieces have HP and various attacks and abilities implemented using OOP. Demoed and presented to instructors as a final term project, resulting in an A grade. Made with Java and JavaFX.",
			"url": "github.com/LittleNa1000/rpg-chess-progmeth-project",
			"hide": false
		}
	],
	"awards": [
		{
			"name": "1st Place Winner of Student Track in LINE Hackathon",
			"details": "- Developed Shon-ma!, a dating app that allows users to match with others in the same bar using LINE Beacon for location detection. Made with Typescript, Node, Express, Next.js, MUI, Firebase, LINE LIFF, and LINE API.",
			"url": "",
			"hide": false
		},
		{
			"name": "Top 32 in Thailand Online Competitive Programming Contest",
			"details": "",
			"url": "",
			"hide": false
		},
		{
			"name": "Asia-Pacific Informatics Olympiad Contestant",
			"details": "",
			"url": "",
			"hide": false
		},
		{
			"name": "1st & 2nd International Olympiad in Informatics Camp Participant",
			"details": "",
			"url": "",
			"hide": false
		},
		{
			"name": "Silver medal in the 16th Thailand Olympiad in Informatics (TOI16)",
			"details": "",
			"url": "",
			"hide": false
		}
	],
	"technologies": [
		{
			"section": "Languages:",
			"details": "C/C++, Python, Java, JavaScript, TypeScript, Node.js, SQL"
		},
		{
			"section": "Frameworks/Libraries:",
			"details": "React, Next.js, NextAuth, Tailwind, MaterialUI, Shadcn, Express.js, NestJS, MongoDB, Postgres, Prisma, TypeORM, tRPC, GraphQL, LINE API"
		},
		{
			"section": "Tools:",
			"details": "AWS, GCP, Firebase, Vercel, Git, GitHub, Docker, Kubernetes, RabbitMQ, Appsmith, Figma, Canva, Jira"
		},
		{
			"section": "Other:",
			"details": "OOP, Data Structures & Algorithms, REST API"
		}
	],
	"workExperiences": [
		{
			"position": "Software Developer (contract)",
			"company": "Skooldio Tech",
			"url": "https://www.skooldio.tech",
			"years": ["Oct 2024", "Present"],
			"details": [
				"Developed additional feature in TCASter mobile app using Next.js, NestJS, and GraphQL"
			]
		},
		{
			"position": "Intern Researcher",
			"company": "Japan Advanced Institute of Science and Technology",
			"url": "https://www.jaist.ac.jp/english",
			"years": ["Jun 2024", "July 2024"],
			"details": [
				"Researched Secure Software Development Surveying at Ishikawa, Japan, with financial support from the institute",
				"Categorized coding practices, OWASP, and CWE guidelines based on implementation steps"
			]
		},
		{
			"position": "Software Developer (intern)",
			"company": "KKP Dime",
			"url": "https://dime.co.th",
			"years": ["Jun 2023", "July 2023"],
			"details": [
				"Worked with the team of developers, QA engineers, and product owners based on Scrum process",
				"Developed new pages for the corporate web with dynamic content and responsive using React and MUI and tested using Cypress.",
				"Contributed to developing and testing Thai Stock Order and Thai Stock Account services using Go and MySQL"
			]
		}
	],
	"extracurricularActivities": [
		{
			"position": "Senior Web Developer",
			"company": "Engineering Student Committee, Chulalongkorn University",
			"url": "https://github.com/esc-chula",
			"years": ["July 2023", "Present"],
			"details": [
				"Prepared and converted raw data to CSV for an orientation website with 40,000+ visitors using Python.",
				"Developed and designed SQL database, admin tool, and backend server with CRUD, input validation, and file uploading for Intania Run website with 4,200+ registrants using Express, NeonDB, Prisma, and Appsmith.",
				"Led a team of developers to develop a project tracker website to facilitate the internal document process in the organization using Next.js, Tailwind, NestJS, and PostgreSQL."
			]
		},
		{
			"position": "Head of Registration and Website",
			"company": "Larngear Camp 23rd",
			"url": "https://larngear.org",
			"years": ["June 2023", "Jan 2024"],
			"details": [
				"Maintained and developed new features in the registration website using PostgreSQL, Spring, and React.",
				"Planned and supervised the registration process from 1,335 applicants via the website to 300 final participants.",
				"Developed an internal tool for the document verification process using Appsmith.",
				"Recruited and led a team of 20, organized and distributed tasks among the team, created a collaborative environment, and guided team members during the preparation and execution phases."
			]
		},
		{
			"position": "Club Member",
			"company": "Thailand Incubator (Thinc.)",
			"url": "https://thinc.in.th",
			"years": ["Oct 2021", "Present"],
			"details": [
				"Developed a redesigned Reg Chula platform using Next.js and LINE OA for a demo in HackChula 2024.",
				"Developed a website for online voting and showing vote results using React and event management and discovery platform for clubs using React and Firebase with a team of 4-6 people in Thinc. 10 Days Project."
			]
		}
	],
	"educations": [
		{
			"head": "B.Eng. Computer Engineering",
			"details": "Chulalongkorn University, TH. 2021-present (GPA 3.48)"
		},
		{
			"head": "Gifted Science and Mathematics Program",
			"details": "Assumption College, TH. 2015-2021 (GPA 3.87 with diploma)"
		}
	],
	"interests": ["Areas : Coding"],
	"resumeUrl": {
		"sourceLink": "https://github.com/LittleNa1000/resume",
		"fullVersion": ""
	}
}
